# https://github.com/Homebrew/homebrew-bundle

# ----------------------------------------
# brew
# ----------------------------------------

brew 'direnv'
brew 'cocoapods'
brew 'ruby-build'
brew 'rbenv'
brew "mas"
brew "chxcode"
brew 'jq'
brew "gh"
brew "nodebrew"
brew "ghq"
brew "peco"
brew "hub"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ----------------------------------------
# tap
# ----------------------------------------
# tap 'homebrew/bundle'
# tap 'homebrew/cask'
# tap 'homebrew/core'
# tap 'klaaspieter/formula'

# ----------------------------------------
# cask
# ----------------------------------------
# --------- priority ---------
# cask 'iterm2'
# cask '1password'
# cask 'google-chrome'
# cask 'xcodes'
cask 'charles'
cask 'clipy'
# cask 'adobe-creative-cloud'
# cask 'adobe-acrobat-reader'
# cask 'google-japanese-ime'
# cask 'slack'
cask 'zoom'

# --------- require ---------

# --- ide
cask 'android-studio'
cask 'visual-studio-code'

# --- dev tool
cask "sf-symbols"
# cask 'quicklook-json'
cask 'proxyman'

# --- other tool
# cask 'microsoft-office'
cask 'miro'
cask 'figma'
cask 'discord'

# --------- optional ---------

# --- dev tool
# cask 'postman'
# cask 'sequel-pro'
# cask 'docker'

# --- other tool
# graphviz
# librsvg
# plantuml


# brew cask alfred link

# ----------------------------------------
# mas
# ----------------------------------------

# Xcode関係の不要ファイルを削除
# mas 'DevCleaner', id: 1388020431

# ----------------------------------------
# Font
# ----------------------------------------
# tap "homebrew/cask-fonts"
# cask "font-migu-1p"
