tap "homebrew/bundle"

brew "cocoapods"
brew "direnv"
brew "gh"
brew "ghq"
brew "hub"
brew "jq"
brew "mas"
brew "nodebrew"
brew "peco"
brew "rbenv"
brew "tig"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "android-studio"
cask "charles"
cask "clipy"
cask "figma"
cask "miro"
cask "proxyman"
cask "sf-symbols"
cask "zoom"

vscode "Dart-Code.dart-code"
vscode "DavidAnson.vscode-markdownlint"
vscode "ecmel.vscode-html-css"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "Shopify.ruby-lsp"
